In [1]:
import pandas as pd
import sqlite3

In [2]:
# conectamos con la base de datos my_database.db
connection = sqlite3.connect("my_database.db")

# obtenemos un cursor que utilizamos para las queries
crsr = connection.cursor()

In [3]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [ ]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0]) # una vez que las tablas estén creadas, deberán aparecer aquí

reparto
cervezas
bares
empleados

In [6]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

reparto
cervezas
bares
empleados

In [ ]:
# hay que crear las tablas

crsr.execute(query)

In [ ]:
query = '''
xxx
'''
# hay que crear las tablas
crsr.execute(query)

In [ ]:
query = '''

'''

crsr.execute(query)

In [ ]:
query = '''

'''
# hay que insertar los datos
crsr.execute(query)

In [ ]:
query = '''

'''
crsr.execute(query)

In [ ]:
query = '''

'''
crsr.execute(query)

In [ ]:
query = '''

'''
crsr.execute(query)

In [15]:
query = '''
SELECT * FROM reparto 
'''
sql_query(query)

  CodE CodB CodC       Fecha  Cantidad
0    1  001   01  2005-10-21       240
1    1  001   02  2005-10-21        48
2    1  002   03  2005-10-22        60
3    1  004   05  2005-10-22         4
4    2  002   03  2005-10-22        48
5    2  002   05  2005-10-23         2
6    2  004   01  2005-10-23       480
7    2  004   02  2005-10-24        72
8    3  003   03  2005-10-24        48
9    3  003   04  2005-10-25        20

In [ ]:
# 1 Obtener el nombre de los empleados que hayan repartido al bar Stop durante la semana 
# del 17 al 23 de octubre de 2005.

query = '''

'''

sql_query(query)

         Nombre
0  Carlos Lopez

In [ ]:
#2
query = '''

'''
sql_query(query)

         Cif      Nombre
0  33333333Z  Otra Ronda
1  11111111X        Stop

In [ ]:
#3
query = '''

'''
sql_query(query)

       Nombre   Envase  Capacidad       Fecha  Cantidad
0        Stop  Botella       0.20  2005-10-21       240
1        Stop  Botella       0.33  2005-10-21        48
2   Las Vegas     Lata       0.33  2005-10-22        60
3  Otra Ronda   Barril      60.00  2005-10-22         4

In [ ]:
#4
query = '''


'''
sql_query(query)

       Nombre   Envase  Capacidad
0        Stop  Botella       0.20
1        Stop  Botella       0.33
2  Otra Ronda  Botella       0.20
3  Otra Ronda  Botella       0.33

In [ ]:
#5
query = '''


'''
sql_query(query)

        nombreE nombreB   Envase
0  Carlos Lopez    Stop  Botella
1  Carlos Lopez    Stop  Botella

In [ ]:
#5 
query = '''

'''
sql_query(query)

        nombreE nombreB   Envase
0  Carlos Lopez    Stop  Botella

In [ ]:
#6
query = '''


'''
sql_query(query)

        nombreE      nombreB   Localidad       Fecha
0  Carlos Lopez   Otra Ronda  La Esponja  2005-10-22
1    Rosa Perez   Otra Ronda  La Esponja  2005-10-23
2    Rosa Perez   Otra Ronda  La Esponja  2005-10-24
3  Luisa Garcia  Club Social   Las Ranas  2005-10-24
4  Luisa Garcia  Club Social   Las Ranas  2005-10-25

In [ ]:
query = '''


'''
sql_query(query)

         Nombre  viajes
0  Carlos Lopez       1
1    Rosa Perez       2
2  Luisa Garcia       2

In [ ]:
query = '''


'''
sql_query(query)

         Nombre  viajes
0  Carlos Lopez       1
1    Rosa Perez       2
2  Luisa Garcia       2

In [ ]:
6#
query = '''

'''
sql_query(query)

        nombreE      nombreB   Localidad  count(distinct r.fecha)
0  Carlos Lopez   Otra Ronda  La Esponja                        1
1  Luisa Garcia  Club Social   Las Ranas                        2
2    Rosa Perez   Otra Ronda  La Esponja                        2

In [ ]:
query = '''


'''
sql_query(query)

Empty DataFrame
Columns: [nombreE, Envase]
Index: []

In [ ]:
# 7
query = '''



'''
sql_query(query)

       nombre   localidad  maximo
0  Otra Ronda  La Esponja   240.0

In [ ]:
#8
query = '''


'''
sql_query(query)

       Nombre
0        Stop
1  Otra Ronda

In [ ]:
query9 = '''

'''
sql_query(query9)

   t.Sueldo*1.05  MAX(t.maximo)      Nombre
0       115500.0              3  Rosa Perez

In [ ]:
query = '''

'''
crsr.execute(query)

In [ ]:
query = '''

'''
sql_query(query)

  CodE
0    2

In [32]:
connection.commit()
connection.close()